# Программа принимает действительное положительное число x и целое отрицательное число y. Необходимо выполнить возведение числа x в степень y.
# Задание необходимо реализовать в виде функции my_func(x, y). При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.


def exponentiation(x, y):
  y = abs(y)
  temp = x
  while y != 1:
    x *= temp
    y -= 1
    exponentiation(temp, y)
  return 1 / x


print("Результат возведения в степень: ", exponentiation(2, -6))
